# -------------------------
# Bluefin Brewfile
# Note: CLIs only!
# -------------------------

# --- Core Terminal utilities --- 
brew "lsd"
brew "tree"
brew "just"

brew "btop"
brew "lnav"

brew "superfile" #May have its own config as well!  
brew "tmux" #SOme notes: tmux, neovim and ghostty all have their own configurations; ghostty is a flatpak that's not currently in the store yet 
brew "Valkyrie00/homebrew-bbrew/bbrew"

brew "claude-code"

# --- Zsh Addons --- 
brew "fzf"
brew "zsh-completions"
brew "eza" #Plugin dependency 
brew "bat" #Plugin dependency 

# --- Bash Addons ---
brew "atuin"
brew "bash-preexec" # Preferred over ble.sh — matches upstream automated installer

# --- DevOps Dev tools ---
brew "act" #Github Actions local testing 

# --- Docker --- 
brew "oxker" #Docker TUI 

# --- Kubernetes tools ---
brew "kubernetes-cli"
brew "kubectx"
brew "k9s"
brew "siderolabs/tap/talosctl"
